eisup_2019_docmng_integration/src/InformationRegisters/ТекущаяРаботаПоЗаявкамКандидатов/ТекущаяРаботаПоЗаявкамКандидатов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущаяРаботаПоЗаявкамКандидатов</name>
  <comment>(Упр)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Состояние</name>
    <type>
      <types>CatalogRef.СостоянияЗаявокКандидатов</types>
    </type>
  </resources>
  <dimensions>
    <name>ЗаявкаКандидата</name>
    <type>
      <types>CatalogRef.ЗаявкиКандидатов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/InformationRegisters/ТекущаяРаботаПоЗаявкамКандидатов/RecordSetModule.bsl
Перем мНеИзменятьСостояниеВЗаявке Экспорт;

Процедура ПриЗаписи(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если мНеИзменятьСостояниеВЗаявке = Неопределено Тогда
		мНеИзменятьСостояниеВЗаявке = Ложь;
	КонецЕсли;
	
	Если мНеИзменятьСостояниеВЗаявке Тогда
		Возврат;
	КонецЕсли;
	
	ЗаявкаКандидата = Отбор.ЗаявкаКандидата.Значение;
	Если Не ЗначениеЗаполнено(ЗаявкаКандидата) Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТекущаяРаботаПоЗаявкамКандидатов.Состояние
	|ИЗ
	|	РегистрСведений.ТекущаяРаботаПоЗаявкамКандидатов КАК ТекущаяРаботаПоЗаявкамКандидатов
	|ГДЕ
	|	ТекущаяРаботаПоЗаявкамКандидатов.Состояние <> ЗНАЧЕНИЕ(Справочник.СостоянияЗаявокКандидатов.ПустаяСсылка)
	|	И ТекущаяРаботаПоЗаявкамКандидатов.ЗаявкаКандидата = &ЗаявкаКандидата
	|
	|УПОРЯДОЧИТЬ ПО
	|	ТекущаяРаботаПоЗаявкамКандидатов.Период УБЫВ";
	Запрос.УстановитьПараметр("ЗаявкаКандидата",	ЗаявкаКандидата);
	
	ЗаявкаКандидатаОбъект = ЗаявкаКандидата.ПолучитьОбъект();
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаявкаКандидатаОбъект.Состояние = Выборка.Состояние;
	Иначе
		ЗаявкаКандидатаОбъект.Состояние = 0;
	КонецЕсли;
	
	ЗаявкаКандидатаОбъект.Записать();
	
КонецПроцедуры
